export const GOVERNORATES = [
  "محافظة العاصمة",
  "محافظة حولي",
  "محافظة الفروانية",
  "محافظة مبارك الكبير",
  "محافظة الأحمدي",
  "محافظة الجهراء"
];

export const AREAS: Record<string, string[]> = {
  "محافظة العاصمة": [
    "الكويت", "دسمان", "الشرق", "الصالحية", "المرقاب", "القبلة", "بنيد القار", "كيفان", "الدسمة", "الدعية", "المنصورية", "عبدالله السالم", "النزهة", "الفيحاء", "الشامية", "الروضة", "العديلية", "الخالدية", "القادسية", "قرطبة", "السرة", "اليرموك", "الشويخ السكنية", "الشويخ الصناعية", "الري", "غرناطة", "صليبيخات", "الدوحة", "النهضة", "القيروان", "جابر الاحمد", "شمال غرب صليبيخات"
  ],
  "محافظة حولي": [
    "حولي", "الشعب", "السالمية", "الرميثية", "الجابرية", "مشرف", "بيان", "البدع", "النقرة", "سلوى", "الزهراء", "حطين", "السلام", "الشهداء", "الصديق", "مبارك عبدالله الجابر"
  ],
  "محافظة الفروانية": [
    "الفروانية", "خيطان", "العمرية", "الرابية", "اشبيلية", "جليب الشيوخ", "جنوب جليب الشيوخ", "الاندلس", "الفردوس", "العارضية", "العارضية الصناعية", "صباح الناصر", "الرقعي", "الرحاب", "عبدالله المبارك", "جنوب عبدالله المبارك", "غرب عبدالله المبارك", "الضجيج"
  ],
  "محافظة مبارك الكبير": [
    "مبارك الكبير", "صباح السالم", "المسيلة", "العدان", "القصور", "القرين", "ابو فطيرة", "الفنيطيس", "ابو الحصانية", "صبحان", "اسواق القرين"
  ],
  "محافظة الأحمدي": [
    "الاحمدي", "الفنطاس", "العقيلة", "جابر العلي", "هدية", "الرقة", "الظهر", "الفحيحيل", "المنقف", "ابو حليفة", "الصباحية", "المهبولة", "فهد الاحمد", "ام الهيمان ( علي صباح السالم )", "ميناء عبدالله", "بنيدر", "الجليعة", "الزور", "الخيران", "صباح الاحمد", "صباح الاحمد البحرية", "خيران السكنية", "الوفرة", "الوفرة السكنية"
  ],
  "محافظة الجهراء": [
    "الجهراء", "الواحة", "العيون", "القصر", "النسيم", "تيماء", "النعيم", "الجهراء الصناعية", "كاظمة", "صليبية", "سعد عبدالله", "المطلاع", "العبدلي", "السالمي", "كبد"
  ]
};

// القيم مطابقة تماماً لما في Google Sheet
export const PROPERTY_TYPES = [
  "ارض",
  "بيت",
  "بيت حكومي",
  "قسيمة مبنية",
  "عمارة",
  "شالية",
  "مزرعة",
  "استثماري",
  "تجاري",
  "طلب"
];

export const PURPOSES = [
  "بيع",
  "شراء",
  "ايجار",
  "استئجار",
  "بدل",
  "مستأجر"
];

export const LOCATIONS = [
  "شارع واحد",
  "شارع وسكة",
  "سد نافد",
  "زاوية شارعين",
  "زاوية مشتركة",
  "بطن وظهر",
  "بطن وظهر وسكة",
  "راس ٣ جهات",
  "راس ٣ شوارع"
];

export const SUPER_ADMIN_EMAILS = ["simsaraqari@gmail.com", "mostafasoliman550@gmail.com", "65814909@realestate.com", "66155981@realestate.com", "admin@musadaqa.com"];
export const SUPER_ADMIN_PHONES = ["65814909", "66155981"];
