export const GOVERNORATES = [
  "محافظة العاصمة",
  "محافظة حولي",
  "محافظة الفروانية",
  "محافظة مبارك الكبير",
  "محافظة الأحمدي",
  "محافظة الجهراء"
];

export const AREAS: Record<string, string[]> = {
  "محافظة العاصمة": [
    "الكويت", "دسمان", "الشرق", "الصالحية", "المرقاب", "القبلة", "بنيد القار", "كيفان", "الدسمة", "الدعية", "المنصورية", "عبدالله السالم", "النزهة", "الفيحاء", "الشامية", "الروضة", "العديلية", "الخالدية", "القادسية", "قرطبة", "السرة", "اليرموك", "الشويخ السكنية", "الشويخ الصناعية", "الري", "غرناطة", "صليبيخات", "الدوحة", "النهضة", "القيروان", "جابر الاحمد", "شمال غرب صليبيخات"
  ],
  "محافظة حولي": [
    "حولي", "الشعب", "السالمية", "الرميثية", "الجابرية", "مشرف", "بيان", "البدع", "النقرة", "سلوى", "الزهراء", "حطين", "السلام", "الشهداء", "الصديق", "مبارك عبدالله الجابر"
  ],
  "محافظة الفروانية": [
    "الفروانية", "خيطان", "العمرية", "الرابية", "اشبيلية", "جليب الشيوخ", "جنوب جليب الشيوخ", "الاندلس", "الفردوس", "العارضية", "العارضية الصناعية", "صباح الناصر", "الرقعي", "الرحاب", "عبدالله المبارك", "جنوب عبدالله المبارك", "غرب عبدالله المبارك", "الضجيج", "المنطقة الرابعة"
  ],
  "محافظة مبارك الكبير": [
    "مبارك الكبير", "صباح السالم", "المسيلة", "العدان", "القصور", "القرين", "ابو فطيرة", "الفنيطيس", "ابو الحصانية", "صبحان", "اسواق القرين"
  ],
  "محافظة الأحمدي": [
    "الاحمدي", "الفنطاس", "العقيلة", "جابر العلي", "هدية", "الرقة", "الظهر", "الفحيحيل", "المنقف", "ابو حليفة", "الصباحية", "المهبولة", "فهد الاحمد", "ام الهيمان ( علي صباح السالم )", "ميناء عبدالله", "بنيدر", "الجليعة", "الزور", "الخيران", "صباح الاحمد", "جنوب صباح الاحمد", "خيران السكنية", "الوفرة", "الوفرة السكنية", "المنطقة العاشرة"
  ],
  "محافظة الجهراء": [
    "الجهراء", "الواحة", "العيون", "القصر", "النسيم", "تيماء", "النعيم", "الجهراء الصناعية", "كاظمة", "صليبية", "سعد عبدالله", "جنوب سعد العبدالله", "المطلاع", "العبدلي", "السالمي", "كبد"
  ]
};

export const PROPERTY_TYPES = [
  "ارض",
  "قسيمة مبنية",
  "بيت حكومي",
  "طلب",
  "شقة",
  "عمارة",
  "استثماري",
  "تجاري",
  "صناعي",
  "مخازن",
  "مزرعة",
  "شالية"
];

export const PURPOSES = [
  "بيع",
  "بدل",
  "ايجار",
  "استئجار",
  "شراء"
];

export const LOCATIONS = [
  "شارع واحد",
  "شارع وسكة",
  "سد نافد",
  "زاوية شارعين",
  "زاوية وسكة",
  "زاوية مشتركة",
  "بطن وظهر",
  "بطن وظهر وسكة",
  "راس ٣ شوارع",
  "راس ٣ جهات"
];

export const SUPER_ADMIN_EMAILS = ["simsaraqari@gmail.com", "mostafasoliman550@gmail.com", "65814909@realestate.com", "66155981@realestate.com"];
export const SUPER_ADMIN_PHONES = ["65814909", "66155981"];
